app/Controllers/frontend/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $productModel = new ProductModel();
        $data = $productModel->findAll();