app/Controllers/Products.php

    public function edit($id){
        $data = $this->products->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'